def linear_system(A, b):
    return None if np.linalg.det(A)==0 else np.dot(np.linalg.inv(A),-b)
    #return np.linalg.solve(A,-b)
    """ Решает систему линейных уравнений A*x + b = 0, заданную в матричной форме

    Аргументы:
        - A:np.ndarray - матрица (nxn) коэффициентов системы линейных уравнений.
        - b:np.ndarray - вектор размера (nx1)

    Возвращает:
        - np.ndarray - вектор размера (nx1), если решение существует
        - None, если решения не существует

    Указания:
        - используйте метод np.linalg.det для проверки обратимости матрицы
        - способ 1:
            - используйте метод np.linalg.inv для инвертирования матрицы
            - авторское решение занимает 63 символа
        - способ 2:
            - используйте метод np.linalg.solve для решения линейной системы
            - авторское решение занимает 64 символа
    """
    pass

def chessboard_pattern(n):
    A=np.zeros((n,n),dtype=np.int64)
    for i in range(n):
        for k in range(n):
            if (i+k)%2!=0:
                A[i][k]=1
    return A
                
    """ Создает двумерный массив, заполненный нулями и единицами в шахматном порядке.
        Поле с индексом [0, 0] должно быть равно нулю. Например, для n = 2:
        [
            [0, 1],
            [1, 0]
        ]
        Для n = 4:
        [
            [0, 1, 0, 1],
            [1, 0, 1, 0],
            [0, 1, 0, 1],
            [1, 0, 1, 0]
        ]

    Аргументы:
        - n:int - четное неотрицательное целое число (n = 0, 2, 4, ...)

    Возвращает:
        - np.ndarray размера (nxn), dtype=np.int64

    Увазания:
        - для инициализации массива нулями можно использовать функцию np.zeros
        - для инициализации массива единицами можно использовать функцию np.ones
        - используйте возможности индексации массивов numpy
        - авторское решение занимает 4 строки
    """
    pass

def sort_by_key(arr, fcn):
    return arr[np.argsort(fcn(arr))]
    """ Сортирует массив arr, используя в качестве ключа функцию fcn
        (подобно стандартной функции sorted с параметром key)

    Аргументы:
        - arr:np.ndarray - одномерный массив
        - fcn:callable - функция, которая преобразует элементы массива

    Возвращает:
        - np.ndarray - отсортированный массив того же размера, что и исходный

    Указания:
        - рассмотрите возможность использования функции np.argsort
        - авторское решение занимает 32 символоа
    """
    pass
